Revit 2026 API

# ColorFillSchemeAddEntry Method

---

Adds new entry to the scheme.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddEntry(
	ColorFillSchemeEntry entry
)
```
```vb
Public Sub AddEntry (
	entry As ColorFillSchemeEntry
)
```
```cpp
public:
void AddEntry(
	ColorFillSchemeEntry^ entry
)
```
```fsharp
member AddEntry :
        entry : ColorFillSchemeEntry -> unit
```

#### Parameters

entry ColorFillSchemeEntry

| Exception | Condition |
| --- | --- |
| ArgumentException | There already exists an entry with the same value in the scheme. -or- The entry value is out of range. -or- The scheme and the entry have different parameter storage type. -or- The fill pattern id is not valid for scheme. |
| ArgumentNullException | A non-optional argument was null |

To make sure that entry can be added to the scheme, call IsEntryConsistentWithScheme(ColorFillSchemeEntry) first.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace